---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.HvacViscosity
source: html/91f2c0a0-5dde-5ed0-2043-bd5f4468a48e.htm
---
# Autodesk.Revit.DB.SpecTypeId.HvacViscosity Property

Dynamic Viscosity, in discipline HVAC.

## Syntax (C#)
```csharp
public static ForgeTypeId HvacViscosity { get; }
```